Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [5]:
li = [4, 8, 15, 16, 23, 42]
df = pd.DataFrame(li)

In [6]:
df

    0
0   4
1   8
2  15
3  16
4  23
5  42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
li = range(0, 10)
li = pd.Series(li)
li

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
data = { "Name": ["Alice", "Bob", "Claire"],
    "Age": [25, 30, 27],
    "Gender": ["Female", "Male", "Female"],
}
df1 = pd.DataFrame(data)
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame stores the data in form of rows and columns. Dataframe(2D) is combination of multiple Series(1D).

In [10]:
print(type(df1))
print(type(li))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

dtype, unique, describe, max, mean are some functions that can be used.

In [11]:
df1.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [12]:
df1.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [13]:
df1.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [16]:
max(df1['Age'])

30

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is data mutable. Dataframe and Panel both are data and size mutable. Panel is a 3D structure.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
li1 = [1,2,]